In [1]:
import predictor

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("../input/Churn_Modelling.csv")

In [4]:
df_head = df.head(5)

In [5]:
df_head

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [6]:
gf = predictor.predict(df_head)

In [7]:
status, gf.columns

AttributeError: 'tuple' object has no attribute 'columns'

In [84]:
gf

Empty DataFrame
Columns: [Surname, CreditScore, Geography, Gender, Age, Tenure, Balance, NumOfProducts, HasCrCard, IsActiveMember, EstimatedSalary, pred_probabilities]
Index: []

In [101]:
import json
json.loads(df_head.to_json(orient="records"))

[{'Surname': 'Hargrave',
  'CreditScore': 619,
  'Geography': 'France',
  'Gender': 'Female',
  'Age': 42,
  'Tenure': 2,
  'Balance': 0.0,
  'NumOfProducts': 1,
  'HasCrCard': 1,
  'IsActiveMember': 1,
  'EstimatedSalary': 101348.88},
 {'Surname': 'Hill',
  'CreditScore': 608,
  'Geography': 'Spain',
  'Gender': 'Female',
  'Age': 41,
  'Tenure': 1,
  'Balance': 83807.86,
  'NumOfProducts': 1,
  'HasCrCard': 0,
  'IsActiveMember': 1,
  'EstimatedSalary': 112542.58},
 {'Surname': 'Onio',
  'CreditScore': 502,
  'Geography': 'France',
  'Gender': 'Female',
  'Age': 42,
  'Tenure': 8,
  'Balance': 159660.8,
  'NumOfProducts': 3,
  'HasCrCard': 1,
  'IsActiveMember': 0,
  'EstimatedSalary': 113931.57},
 {'Surname': 'Boni',
  'CreditScore': 699,
  'Geography': 'France',
  'Gender': 'Female',
  'Age': 39,
  'Tenure': 1,
  'Balance': 0.0,
  'NumOfProducts': 2,
  'HasCrCard': 0,
  'IsActiveMember': 0,
  'EstimatedSalary': 93826.63},
 {'Surname': 'Mitchell',
  'CreditScore': 850,
  'Geography': 'Spain',
  'Gender': 'Female',
  'Age': 43,
  'Tenure': 2,
  'Balance': 125510.82,
  'NumOfProducts': 1,
  'HasCrCard': 1,
  'IsActiveMember': 1,
  'EstimatedSalary': 79084.1}]